package hw_22;

public class Main {
    /*
    Задача 1
Создать класс Calculator, способный выполнять два арифметических действия - сложение двух чисел,
вычитание двух чисел а также сложение трех чисел и вычитание трех чисел.
Калькулятор должен работать как для целых чисел, так и для чисел с запятой.
(т.е. в классе надо создать соответствующие методы и затем вызывать их в методе main)
     */
    public static void main(String[] args) {
        System.out.println(Calculator.sum(2.45, 1));
        System.out.println(Calculator.substr(3,5,8));


    }

}
